---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinHookTypen1
source: html/1b83b0df-b3dc-e5c5-5933-579b1ba877bf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinHookTypen1 Property

"Primary Bar - Start Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinHookTypen1 { get; }
```